app/Controllers/Simpanan.php

UPDATE `riwayat_simpanan` SET `status` = 200
WHERE `order_id` = '1728399832'
---
            }
            // var_dump($data);
            // die;
            $success = $this->riwayat_simpanan->where('order_id', $sw->order_id)->set($data)->update();

UPDATE `simpanan_manasuka` SET `status` = 1
WHERE `order_id` = '159616030'
---
            }
            // var_dump($data);
            // die;
            $success = $this->simpanan_manasuka->where('order_id', $sw->order_id)->set($data)->update();