app/Models/UserModel.php

    public function getUser($username = false)
    {
        if ($username == false) {
            return $this->orderBy('role', 'ASC')->findAll();
        }

        return $this->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'qwe'
 LIMIT 1